BattleMain.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>BattleMain</title>
<!-- 2018-06-08 五 15:56 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yuanchuan cao" />
</head>
<body>
<div id="content">
<h1 class="title">BattleMain</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. introduction</a>
<ul>
<li><a href="#sec-1-1">1.1. variables</a></li>
<li><a href="#sec-1-2">1.2. methods</a></li>
<li><a href="#sec-1-3">1.3. GameStateMain</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. variables</a></li>
<li><a href="#sec-1-3-2">1.3.2. GameStateBase</a></li>
<li><a href="#sec-1-3-3">1.3.3. methods</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="krr.html">go back to code-map</a>
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
BattleMain 继承于 <a href="#sec-1-3">GameStateMain</a>, 整个游戏都是同过改变某个State然后不断的 Update()来实现游戏的运行， 这些包括进入，退出，更新，退出后处理，变更状态等多个<a href="#sec-1-3-2">method</a>。BattleMain 继承了这一点，并通过重写 (override) 其中的一些 method 来实现交互：
</p>

<ul class="org-ul">
<li>BattleMain 最重要的成员就是 <a href="#coderef-m_System"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-m_System');" onmouseout="CodeHighlightOff(this, 'coderef-m_System');">BattleSystem</a>
</li>
<li>BattleMain 最核心的工作就是 Update, 其中最重要的一步就是 <a href="#coderef-systemUpdate"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-systemUpdate');" onmouseout="CodeHighlightOff(this, 'coderef-systemUpdate');">BattleSystem.SystemUpdate()</a>
</li>
<li><a href="#coderef-start"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-start');" onmouseout="CodeHighlightOff(this, 'coderef-start');">BattleMain.Start()</a> 如下
<ol class="org-ol">
<li><a href="#coderef-initID"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-initID');" onmouseout="CodeHighlightOff(this, 'coderef-initID');">NextState 初始化是 -1</a>, 并被改变为 1
</li>
<li><a href="#coderef-baseUpdate"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-baseUpdate');" onmouseout="CodeHighlightOff(this, 'coderef-baseUpdate');">BattleMain.Update()</a> 进入 <a href="#coderef-mainUpdate"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-mainUpdate');" onmouseout="CodeHighlightOff(this, 'coderef-mainUpdate');">GameStateMain.Update()</a>，NextState被重置-1
</li>
<li>由于NextState 的改变，保存了当前状态之后， 我们进入<a href="#coderef-changeState"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-changeState');" onmouseout="CodeHighlightOff(this, 'coderef-changeState');">.ChangeState()</a>
</li>
<li>它已被改写为<a href="#coderef-override"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-override');" onmouseout="CodeHighlightOff(this, 'coderef-override');">BattleMain.ChangeState()</a>
</li>
<li>初始化后进入核心的 <a href="#coderef-systemUpdate"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-systemUpdate');" onmouseout="CodeHighlightOff(this, 'coderef-systemUpdate');">BattleSystem.SystemUpdate()</a>
</li>
<li><b>并且由于NextState被重置-1，第3,4步被跳过， 以后的<a href="#coderef-baseUpdate"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-baseUpdate');" onmouseout="CodeHighlightOff(this, 'coderef-baseUpdate');">BattleMain.Update()</a> 等价于<a href="#coderef-systemUpdate"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-systemUpdate');" onmouseout="CodeHighlightOff(this, 'coderef-systemUpdate');">BattleSystem.SystemUpdate()</a></b>
</li>
</ol>
</li>
</ul>
</div>


<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> variables</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">STATE_MAIN</span> = 1;

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">STATE_RESULT</span> = 2;

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">STATE_FINAL</span> = 3;

<span id="coderef-m_System" class="coderef-off"><span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #7CB8BB;">BattleSystem</span> <span style="color: #DFAF8F;">m_System</span>; <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">method: System()</span></span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> methods</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-csharp"><span id="coderef-start" class="coderef-off"><span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">Start</span>() {<span style="color: #F0DFAF; font-weight: bold;">base</span>.SetNextState(1);}</span>

<span style="color: #F0DFAF; font-weight: bold;">protected</span> <span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">Update</span>()
{

<span id="coderef-baseUpdate" class="coderef-off">        <span style="color: #F0DFAF; font-weight: bold;">base</span>.Update();  <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">GameStateMain.Update();</span></span>

<span id="coderef-systemUpdate" class="coderef-off">        <span style="color: #F0DFAF; font-weight: bold;">this</span>.m_System.SystemUpdate();</span>
}

<span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">LateUpdate</span>()
{
        <span style="color: #F0DFAF; font-weight: bold;">this</span>.m_System.SystemLateUpdate();
}

<span id="coderef-override" class="coderef-off"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">override</span> <span style="color: #7CB8BB;">GameStateBase</span> <span style="color: #93E0E3;">ChangeState</span>(<span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">stateID</span>)</span>
{
        <span style="color: #F0DFAF; font-weight: bold;">switch</span> (<span style="color: #F0DFAF; font-weight: bold;">base</span>.m_NextStateID)
        {
        <span style="color: #F0DFAF; font-weight: bold;">case</span> 1:
                <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #7CB8BB;">BattleState_Main</span>(<span style="color: #F0DFAF; font-weight: bold;">this</span>); <span style="color: #5F7F5F;">//</span><span style="color: #7F9F7F;">&#21021;&#22987;&#21270;&#31243;&#24207;</span>
        <span style="color: #F0DFAF; font-weight: bold;">case</span> 2:
                <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #7CB8BB;">BattleState_Result</span>(<span style="color: #F0DFAF; font-weight: bold;">this</span>);
        <span style="color: #F0DFAF; font-weight: bold;">case</span> 3:
                <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #F0DFAF; font-weight: bold;">new</span> <span style="color: #7CB8BB;">BattleState_Final</span>(<span style="color: #F0DFAF; font-weight: bold;">this</span>);
        <span style="color: #F0DFAF; font-weight: bold;">default</span>:
                <span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">null</span>;
        }
}
</pre>
</div>
</div>
</div>




<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> GameStateMain</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="#sec-1-3-2">GameStateBase</a> 提供了事后将要被重写的诸如 进入，退出，更新，退出后处理，变更状态等多个 <a href="#sec-1-3-2">method</a>.  注意初始化 <a href="#coderef-initID"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-initID');" onmouseout="CodeHighlightOff(this, 'coderef-initID');"><code>m_NextStateID</code></a> 是 -1.
</p>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> variables</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">const</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">COMMON_STATE_FINAL</span> = 2147483646;

<span style="color: #F0DFAF; font-weight: bold;">protected</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">m_PrevStateID</span> = -1;

<span id="coderef-initID" class="coderef-off"><span style="color: #F0DFAF; font-weight: bold;">protected</span> <span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">m_NextStateID</span> = -1;</span>

<span style="color: #F0DFAF; font-weight: bold;">private</span> SceneDefine.<span style="color: #7CB8BB;">eSceneID</span> <span style="color: #DFAF8F;">m_NextTransitSceneID</span> = SceneDefine.eSceneID.None;

<span style="color: #F0DFAF; font-weight: bold;">protected</span> <span style="color: #7CB8BB;">GameStateBase</span> <span style="color: #DFAF8F;">m_CurrentState</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> GameStateBase</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
this is for override functions
</p>

<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">GetStateID</span>();

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">OnStateEnter</span>();

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">OnStateUpdate</span>();

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">OnStateExit</span>();

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">OnDispose</span>();         

<span style="color: #F0DFAF; font-weight: bold;">protected</span> <span style="color: #F0DFAF; font-weight: bold;">abstract</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">OnClickBackButton</span>(<span style="color: #7CB8BB;">bool</span> <span style="color: #DFAF8F;">isCallFromShortCut</span>);
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> methods</h4>
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">SetNextState</span>(<span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">nextStateID</span>){}

<span id="coderef-mainUpdate" class="coderef-off"><span style="color: #F0DFAF; font-weight: bold;">protected</span> <span style="color: #F0DFAF; font-weight: bold;">virtual</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">Update</span>()</span>
{
 <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">check if nextstate is changed: </span>
 <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">if so, we need to save current id to m_PrevStateID</span>
 <span style="color: #5F7F5F;">//// </span><span style="color: #7F9F7F;">then: .OnStateExit(); .OnDispose(); and set (NextStateID = -1)</span>
<span id="coderef-changeState" class="coderef-off"> <span style="color: #5F7F5F;">//// </span><span style="color: #7F9F7F;">GameStateBase.ChangeState(this.m_NextStateID);</span></span>
 <span style="color: #5F7F5F;">//// </span><span style="color: #7F9F7F;">.OnStateEnter() </span>

 <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">at last: .OnStateUpdate()</span>
}

<span style="color: #F0DFAF; font-weight: bold;">private</span> <span style="color: #7CB8BB;">void</span> <span style="color: #93E0E3;">OnDestroy</span>() {<span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">.OnDispose and set to null}</span>

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">virtual</span> <span style="color: #7CB8BB;">GameStateBase</span> <span style="color: #93E0E3;">ChangeState</span>(<span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">stateID</span>){<span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">null</span>;} <span style="color: #5F7F5F;">// </span><span style="color: #7F9F7F;">this will be override </span>

<span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">virtual</span> <span style="color: #7CB8BB;">bool</span> <span style="color: #93E0E3;">IsCompleteDestroy</span>() {<span style="color: #F0DFAF; font-weight: bold;">return</span> <span style="color: #BFEBBF;">true</span>;}
</pre>
</div>






<p>
<a href="krr.html">go back to code map </a> <a href="#sec-1">go top</a>
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yuanchuan cao</p>
<p class="date">Created: 2018-06-08 五 15:56</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
